grevaillot/svd_tools/headers/ATSAM4SP32A/pwm.h
#define PWM_CMPM6_CTR_SHIFT		4
#define PWM_CMPM6_CTR_MASK		0x0f
/** @defgroup pwm_cmpm6_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM6_CEN Comparison x Enable **/
#define PWM_CMPM6_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd6 CMPMUPD6 PWM Comparison 6 Mode Update Register
@{*/


#define PWM_CMPMUPD6_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD6_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd6_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD6_CPRUPD_SHIFT		8
#define PWM_CMPMUPD6_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd6_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD6_CTRUPD_SHIFT		4
#define PWM_CMPMUPD6_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd6_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM_CMPMUPD6_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD6_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv7 CMPV7 PWM Comparison 7 Value Register
@{*/

/** PWM_CMPV7_CVM Comparison x Value Mode **/
#define PWM_CMPV7_CVM		(1 << 24)

#define PWM_CMPV7_CV_SHIFT		0
#define PWM_CMPV7_CV_MASK		0xffffff
/** @defgroup pwm_cmpv7_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd7 CMPVUPD7 PWM Comparison 7 Value Update Register
@{*/

/** PWM_CMPVUPD7_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD7_CVMUPD		(1 << 24)

#define PWM_CMPVUPD7_CVUPD_SHIFT		0
#define PWM_CMPVUPD7_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd7_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm7 CMPM7 PWM Comparison 7 Mode Register
@{*/


#define PWM_CMPM7_CUPRCNT_SHIFT		20
#define PWM_CMPM7_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm7_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM7_CUPR_SHIFT		16
#define PWM_CMPM7_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm7_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM7_CPRCNT_SHIFT		12
#define PWM_CMPM7_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm7_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM7_CPR_SHIFT		8
#define PWM_CMPM7_CPR_MASK		0x0f
/** @defgroup pwm_cmpm7_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM_CMPM7_CTR_SHIFT		4
#define PWM_CMPM7_CTR_MASK		0x0f
/** @defgroup pwm_cmpm7_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM7_CEN Comparison x Enable **/
#define PWM_CMPM7_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd7 CMPMUPD7 PWM Comparison 7 Mode Update Register
@{*/


#define PWM_CMPMUPD7_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD7_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd7_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD7_CPRUPD_SHIFT		8
#define PWM_CMPMUPD7_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd7_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD7_CTRUPD_SHIFT		4
#define PWM_CMPMUPD7_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd7_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM_CMPMUPD7_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD7_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmr0 CMR0 PWM Channel Mode Register (ch_num = 0)
@{*/

/** PWM_CMR0_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR0_DTLI		(1 << 18)
/** PWM_CMR0_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR0_DTHI		(1 << 17)
/** PWM_CMR0_DTE Dead-Time Generator Enable **/
#define PWM_CMR0_DTE		(1 << 16)
/** PWM_CMR0_CES Counter Event Selection **/
#define PWM_CMR0_CES		(1 << 10)
/** PWM_CMR0_CPOL Channel Polarity **/
#define PWM_CMR0_CPOL		(1 << 9)
/** PWM_CMR0_CALG Channel Alignment **/
#define PWM_CMR0_CALG		(1 << 8)

#define PWM_CMR0_CPRE_SHIFT		0
#define PWM_CMR0_CPRE_MASK		0x0f
/** @defgroup pwm_cmr0_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdty0 CDTY0 PWM Channel Duty Cycle Register (ch_num = 0)
@{*/


#define PWM_CDTY0_CDTY_SHIFT		0
#define PWM_CDTY0_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty0_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd0 CDTYUPD0 PWM Channel Duty Cycle Update Register (ch_num = 0)
@{*/


#define PWM_CDTYUPD0_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD0_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd0_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd0 CPRD0 PWM Channel Period Register (ch_num = 0)
@{*/


#define PWM_CPRD0_CPRD_SHIFT		0
#define PWM_CPRD0_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd0_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd0 CPRDUPD0 PWM Channel Period Update Register (ch_num = 0)
@{*/


#define PWM_CPRDUPD0_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD0_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd0_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt0 CCNT0 PWM Channel Counter Register (ch_num = 0)
@{*/


#define PWM_CCNT0_CNT_SHIFT		0
#define PWM_CCNT0_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt0_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt0 DT0 PWM Channel Dead Time Register (ch_num = 0)
@{*/


#define PWM_DT0_DTL_SHIFT		16
#define PWM_DT0_DTL_MASK		0xffff
/** @defgroup pwm_dt0_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT0_DTH_SHIFT		0
#define PWM_DT0_DTH_MASK		0xffff
/** @defgroup pwm_dt0_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd0 DTUPD0 PWM Channel Dead Time Update Register (ch_num = 0)
@{*/


#define PWM_DTUPD0_DTLUPD_SHIFT		16
#define PWM_DTUPD0_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd0_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD0_DTHUPD_SHIFT		0
#define PWM_DTUPD0_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd0_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmr1 CMR1 PWM Channel Mode Register (ch_num = 1)
@{*/

/** PWM_CMR1_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR1_DTLI		(1 << 18)
/** PWM_CMR1_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR1_DTHI		(1 << 17)
/** PWM_CMR1_DTE Dead-Time Generator Enable **/
#define PWM_CMR1_DTE		(1 << 16)
/** PWM_CMR1_CES Counter Event Selection **/
#define PWM_CMR1_CES		(1 << 10)
/** PWM_CMR1_CPOL Channel Polarity **/
#define PWM_CMR1_CPOL		(1 << 9)
/** PWM_CMR1_CALG Channel Alignment **/
#define PWM_CMR1_CALG		(1 << 8)

