grevaillot/svd_tools/headers/ATSAM4SP32A/pwm.h
#define PWM_CMR1_CPRE_SHIFT		0
#define PWM_CMR1_CPRE_MASK		0x0f
/** @defgroup pwm_cmr1_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdty1 CDTY1 PWM Channel Duty Cycle Register (ch_num = 1)
@{*/


#define PWM_CDTY1_CDTY_SHIFT		0
#define PWM_CDTY1_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty1_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd1 CDTYUPD1 PWM Channel Duty Cycle Update Register (ch_num = 1)
@{*/


#define PWM_CDTYUPD1_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD1_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd1_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd1 CPRD1 PWM Channel Period Register (ch_num = 1)
@{*/


#define PWM_CPRD1_CPRD_SHIFT		0
#define PWM_CPRD1_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd1_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd1 CPRDUPD1 PWM Channel Period Update Register (ch_num = 1)
@{*/


#define PWM_CPRDUPD1_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD1_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd1_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt1 CCNT1 PWM Channel Counter Register (ch_num = 1)
@{*/


#define PWM_CCNT1_CNT_SHIFT		0
#define PWM_CCNT1_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt1_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt1 DT1 PWM Channel Dead Time Register (ch_num = 1)
@{*/


#define PWM_DT1_DTL_SHIFT		16
#define PWM_DT1_DTL_MASK		0xffff
/** @defgroup pwm_dt1_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT1_DTH_SHIFT		0
#define PWM_DT1_DTH_MASK		0xffff
/** @defgroup pwm_dt1_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd1 DTUPD1 PWM Channel Dead Time Update Register (ch_num = 1)
@{*/


#define PWM_DTUPD1_DTLUPD_SHIFT		16
#define PWM_DTUPD1_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd1_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD1_DTHUPD_SHIFT		0
#define PWM_DTUPD1_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd1_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmr2 CMR2 PWM Channel Mode Register (ch_num = 2)
@{*/

/** PWM_CMR2_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR2_DTLI		(1 << 18)
/** PWM_CMR2_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR2_DTHI		(1 << 17)
/** PWM_CMR2_DTE Dead-Time Generator Enable **/
#define PWM_CMR2_DTE		(1 << 16)
/** PWM_CMR2_CES Counter Event Selection **/
#define PWM_CMR2_CES		(1 << 10)
/** PWM_CMR2_CPOL Channel Polarity **/
#define PWM_CMR2_CPOL		(1 << 9)
/** PWM_CMR2_CALG Channel Alignment **/
#define PWM_CMR2_CALG		(1 << 8)

#define PWM_CMR2_CPRE_SHIFT		0
#define PWM_CMR2_CPRE_MASK		0x0f
/** @defgroup pwm_cmr2_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdty2 CDTY2 PWM Channel Duty Cycle Register (ch_num = 2)
@{*/


#define PWM_CDTY2_CDTY_SHIFT		0
#define PWM_CDTY2_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty2_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd2 CDTYUPD2 PWM Channel Duty Cycle Update Register (ch_num = 2)
@{*/


#define PWM_CDTYUPD2_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD2_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd2_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd2 CPRD2 PWM Channel Period Register (ch_num = 2)
@{*/


#define PWM_CPRD2_CPRD_SHIFT		0
#define PWM_CPRD2_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd2_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd2 CPRDUPD2 PWM Channel Period Update Register (ch_num = 2)
@{*/


#define PWM_CPRDUPD2_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD2_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd2_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt2 CCNT2 PWM Channel Counter Register (ch_num = 2)
@{*/


#define PWM_CCNT2_CNT_SHIFT		0
#define PWM_CCNT2_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt2_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt2 DT2 PWM Channel Dead Time Register (ch_num = 2)
@{*/


#define PWM_DT2_DTL_SHIFT		16
#define PWM_DT2_DTL_MASK		0xffff
/** @defgroup pwm_dt2_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT2_DTH_SHIFT		0
#define PWM_DT2_DTH_MASK		0xffff
/** @defgroup pwm_dt2_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd2 DTUPD2 PWM Channel Dead Time Update Register (ch_num = 2)
@{*/


#define PWM_DTUPD2_DTLUPD_SHIFT		16
#define PWM_DTUPD2_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd2_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD2_DTHUPD_SHIFT		0
#define PWM_DTUPD2_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd2_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmr3 CMR3 PWM Channel Mode Register (ch_num = 3)
@{*/

/** PWM_CMR3_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR3_DTLI		(1 << 18)
/** PWM_CMR3_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR3_DTHI		(1 << 17)
/** PWM_CMR3_DTE Dead-Time Generator Enable **/
#define PWM_CMR3_DTE		(1 << 16)
/** PWM_CMR3_CES Counter Event Selection **/
#define PWM_CMR3_CES		(1 << 10)
/** PWM_CMR3_CPOL Channel Polarity **/
#define PWM_CMR3_CPOL		(1 << 9)
/** PWM_CMR3_CALG Channel Alignment **/
#define PWM_CMR3_CALG		(1 << 8)

#define PWM_CMR3_CPRE_SHIFT		0
#define PWM_CMR3_CPRE_MASK		0x0f
/** @defgroup pwm_cmr3_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdty3 CDTY3 PWM Channel Duty Cycle Register (ch_num = 3)
@{*/


#define PWM_CDTY3_CDTY_SHIFT		0
#define PWM_CDTY3_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty3_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd3 CDTYUPD3 PWM Channel Duty Cycle Update Register (ch_num = 3)
@{*/


#define PWM_CDTYUPD3_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD3_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd3_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd3 CPRD3 PWM Channel Period Register (ch_num = 3)
@{*/


#define PWM_CPRD3_CPRD_SHIFT		0
#define PWM_CPRD3_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd3_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd3 CPRDUPD3 PWM Channel Period Update Register (ch_num = 3)
@{*/


#define PWM_CPRDUPD3_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD3_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd3_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt3 CCNT3 PWM Channel Counter Register (ch_num = 3)
@{*/


#define PWM_CCNT3_CNT_SHIFT		0
#define PWM_CCNT3_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt3_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt3 DT3 PWM Channel Dead Time Register (ch_num = 3)
@{*/


#define PWM_DT3_DTL_SHIFT		16
#define PWM_DT3_DTL_MASK		0xffff
/** @defgroup pwm_dt3_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT3_DTH_SHIFT		0
#define PWM_DT3_DTH_MASK		0xffff
/** @defgroup pwm_dt3_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd3 DTUPD3 PWM Channel Dead Time Update Register (ch_num = 3)
@{*/


#define PWM_DTUPD3_DTLUPD_SHIFT		16
#define PWM_DTUPD3_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd3_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD3_DTHUPD_SHIFT		0
#define PWM_DTUPD3_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd3_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/
